{
  "profile": {
    "name_kr": "전현준",
    "name_en": "HYUNJUN Jeon",
    "subtitle_kr": "AI & Neuroscience Explorer",
    "subtitle_en": "AI & Neuroscience Explorer",
    "bio_kr": "고개를 들어 세계를 보겠습니다. 세계라는 무대에서 만나뵙겠습니다.<br><br>저는 인공지능과 인류의 뇌를 공부하고 있는 전현준입니다.",
    "bio_en": "I will lift my head and look at the world. I will stand on the stage called the world.<br><br>I am Hyunjun Jeon, studying artificial intelligence and the human brain."
  },
  "journey": [
    {
      "year": "2026.01 - Present",
      "title_kr": "MIT 6.0002 (OCW)",
      "title_en": "MIT 6.0002 (OCW)",
      "desc_kr": "Computational Thinking and Data Science",
      "desc_en": "Computational Thinking and Data Science",
      "tags": [
        "Data Science",
        "Python"
      ]
    },
    {
      "year": "2025.11 - 2026.01",
      "title_kr": "MIT 6.0001 (OCW)",
      "title_en": "MIT 6.0001 (OCW)",
      "desc_kr": "Introduction to CS and Programming in Python",
      "desc_en": "Introduction to CS and Programming in Python",
      "tags": [
        "CS",
        "Python"
      ]
    },
    {
      "year": "2021 - 2024",
      "title_kr": "충북공업고등학교",
      "title_en": "Chungbuk Technical High School",
      "desc_kr": "",
      "desc_en": "",
      "tags": [
        "Education"
      ]
    }
  ],
  "work": [
    {
      "year": "2026.01",
      "title": "HND Framework: Preprint Release",
      "desc_kr": "2026년 1월 13일, HND 프레임워크의 연구 성과를 담은 논문 초안을 ArXiv에 공개했습니다.",
      "desc_en": "Released the research preprint for the HND Framework on ArXiv on January 13, 2026.",
      "tags": [
        "Paper",
        "ArXiv"
      ]
    },
    {
      "year": "2026",
      "title": "HND (Hypothesis-driven Negative) Framework",
      "desc_kr": "기존 유클리드 공식은 두 변수의 상호작용과 제약 조건($\\gcd(m,k)=1$)으로 인해 AI가 구조적 규칙을 찾기 어렵습니다. 본 연구는 슈티펠의 고전적 수열을 단일 변수 $n$으로 변환한 **Index Theory**를 사용하여, AI에게 가장 명확한 수론적 질서를 제시합니다.",
      "desc_en": "The existing Euclidean formula makes it difficult for AI to discover structural patterns due to the interaction between two variables and the constraint condition ($\\gcd(m,k)=1$). This study employs **exponential theory**, which transforms Stifel's classical sequence into a single variable $n$, to present the clearest possible arithmetic order to AI.",
      "tags": [
        "Paper"
      ]
    }
  ],
  "contact": {
    "email": "hyunjun050915@gmail.com",
    "github": "XaicuL",
    "github_url": "https://github.com/XaicuL"
  },
  "re": [
    {
      "month": "2026.01",
      "url": "#",
      "title": "2026년을 맞이하며 (Welcoming 2026)",
      "title_en": "Welcoming 2026",
      "desc_kr": "정말 질기고 길게 느껴졌던 2025년이 저물고 비로소 올 것 같지 않던 너무나 멀게 느껴지던 2026년이 밝았다.  <br>작년 1월 1일은 쓰라린 기억으로 남아있지만, 올해의 첫날은 그 아픔을 되새기며 차분히 잠을 청했다.  <br>  <br>1월 2일이 되고 커피를 마시며 나의 캘린더를 슥슥 내려보았다. 2030년까지 빽빽한 Future 캘린더..  <br>그 와중에도 2026년은 숨 가쁘게 흘러갈 것 같다. 아직 가보지 않은 길을 걷게 되는거라서 무섭기도 하고 설레기도 한 그런.. 느낌,,  <br>그런데도 달라지지 않는건 내 캘린더는 이미 포화 상태다. 아니 이미 폭파 했을지도 모른다.  <br>하고 싶은 건 넘치는데 몸은 하나라, 무엇보다 우선순위를 냉철하게 정해야 할 시점이라는걸 다시금 느끼곤 한다.  <br>  <br>격변은 1월부터 시작될 듯하다. MIT 6.0001 과정을 마무리하고 6.0002를 시작하게 된다.  <br>HND 연구는... 부디 초안이라도 완성되어 있기를  <br>사실 아직 학부 입학도 하지 않은 내가 연구라는 것을 해도 되는 걸까, 라는 의문이 끊임없이 들곤 한다.  <br>모르겠다. 그저 부디, 이 1월이 무탈하게 잘 마무리되길 바랄 뿐이다 :)  <br>아 마지막으로 입학 전에 영어에 대한 공포증을 없애고 입학하고 싶네.",
      "desc_en": "The year 2025, which felt so incredibly long and tenacious, has finally faded, and 2026—a year that felt so far away it seemed it would never arrive—has finally dawned.<br>While January 1st of last year remains a bitter memory, I spent the first day of this year in a calm sleep, reflecting on that pain.<br><br>On January 2nd, while having coffee, I scrolled through my calendar. A \"Future Calendar\" packed tightly all the way to 2030.<br>Even within that, 2026 looks like it will pass by at a breathless pace. I feel a mix of fear and excitement, walking a path I’ve never trodden before… a certain... feeling,,<br>Nevertheless, one thing remains unchanged: my calendar is already saturated. In fact, it might have already exploded.<br>With so much I want to do but only one body, I feel once again that this is the moment to coldly determine my priorities.<br><br>The upheaval seems set to begin in January. I will finish the MIT 6.0001 course and start 6.0002.<br>As for the HND research... I just hope at least a draft is completed.<br>Truthfully, as someone who hasn't even entered undergraduate studies yet, I constantly question whether it's okay for me to be doing \"research.\"<br>I don't know. I just hope, sincerely, that this January concludes smoothly and well :)<br>Ah, one last thing: I'd like to overcome my phobia of English before I enroll."
    }
  ]
}